export const MaritalStatusOptions = [
  "в браке",
  "в гражданском браке",
  "в браке, но вместе не живем",
  "в разводе",
  "вдова(ец)",
  "живу без партнера",
  "иное",
];

export const PartnerOccupationOptions = [
  "работает",
  "учится",
  "не работает",
  "свой вариант",
];

export const RelationshipDurationOptions = [
  "меньше года",
  "1 год",
  "2 года",
  "3 года",
  "4 года",
  "5 лет",
  "6 лет",
  "7 лет",
  "8 лет",
  "9 лет",
  "10 лет",
  "более 10 лет",
];

export const RelationshipQualityOptions = [
  "очень хорошие",
  "хорошие",
  "средние",
  "плохие",
  "очень плохие",
];

export const RelationshipEndReasonOptions = [
  "разрыв по инициативе партнера",
  "разрыв по вашей инициативе",
  "взаимное решение",
  "смерть партнера",
  "свой вариант",
];

export const LivingConditionsOptions = [
  "у своих родителей",
  "у родителей супруга",
  "снимаю свое жилье",
  "собственная квартира",
  "собственный дом",
  "у партнера",
  "ваш вариант",
];

export const LivingConditionsSatisfactionOptions = [
  "очень удовлетворен",
  "удовлетворен",
  "средне удовлетворен",
  "неудовлетворен",
  "очень неудовлетворен",
  "ваш вариант",
];
