export const motherRelationshipRatingOptions = [
  "не жила со мной, я воспитывался другим человеком",
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, она мало спрашивала про мои дела",
  "она участвовала в моих делах, но без особой эмоциональной привязанности",
  "в основном были теплые и близкие отношения, обнимали друг друга",
];

export const fatherRelationshipRatingOptions = [
  "не жил со мной, я воспитывался другим человеком",
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, он мало спрашивал про мои дела",
  "он участвовала в моих делах, но без особой эмоциональной привязанности",
  "в основном были теплые и близкие отношения, обнимали друг друга",
];

export const stepmotherRelationshipRatingOptions = [
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, она мало спрашивала про мои дела",
  "она участвовала в моих делах, но без особой эмоциональной привязанности",
  " в основном были теплые и близкие отношения, обнимали друг друга",
  "ваш вариант",
];

export const stepfatherRelationshipRatingOptions = [
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, он мало спрашивала про мои дела",
  "он участвовал в моих делах, но без особой эмоциональной привязанности",
  " в основном были теплые и близкие отношения, обнимали друг друга",
  "ваш вариант",
];

export const divorceWhoLivedWithOptions = ["отцом", "матерью", "свой вариант"];

export const siblingsChildhoodRelationshipOptions = [
  "чаще жертвой агрессии братьев/сестер",
  "чаще агрессором по отношению к ним",
  "в хороших дружеских отношениях",
  "практически не общались",
  "жили раздельно / в разных семьях",
  "ваш вариант",
];

export const siblingsCurrentRelationshipOptions = [
  "не общаемся, в конфликте",
  "не общаемся, равнодушен",
  "общаемся по поводу и праздникам",
  "в хороших дружеских отношениях",
  "ваш вариант",
];
