export const motherRelationshipRatingOptions = [
  "не жила со мной, я воспитывался другим человеком",
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, она мало спрашивала про мои дела",
  "она участвовала в моих делах, но без особой эмоциональной привязанности",
  "в основном были теплые и близкие отношения, обнимали друг друга",
];

export const fatherRelationshipRatingOptions = [
  "не жил со мной, я воспитывался другим человеком",
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, он мало спрашивал про мои дела",
  "он участвовала в моих делах, но без особой эмоциональной привязанности",
  "в основном были теплые и близкие отношения, обнимали друг друга",
];

export const stepmotherRelationshipRatingOptions = [
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, она мало спрашивала про мои дела",
  "она участвовала в моих делах, но без особой эмоциональной привязанности",
  " в основном были теплые и близкие отношения, обнимали друг друга",
  "ваш вариант",
];

export const stepfatherRelationshipRatingOptions = [
  "в моем детстве жили вместе, но громко ругались или имело место эмоциональное или физическое насилие",
  "не ругались, но почти не обнимались, он мало спрашивала про мои дела",
  "он участвовал в моих делах, но без особой эмоциональной привязанности",
  " в основном были теплые и близкие отношения, обнимали друг друга",
  "ваш вариант",
];

export const divorceWhoLivedWithOptions = ["отцом", "матерью", "свой вариант"];

export const siblingsChildhoodRelationshipOptions = [
  "чаще жертвой агрессии братьев/сестер",
  "чаще агрессором по отношению к ним",
  "в хороших дружеских отношениях",
  "практически не общались",
  "жили раздельно / в разных семьях",
  "ваш вариант",
];

export const siblingsCurrentRelationshipOptions = [
  "не общаемся, в конфликте",
  "не общаемся, равнодушен",
  "общаемся по поводу и праздникам",
  "в хороших дружеских отношениях",
  "ваш вариант",
];

export const parentalOverprotectionOptions = [
  "очень негативно, как сильное давление, ограничение свободы",
  "скорее негативно",
  "нейтрально",
  "скорее положительно",
  "очень положительно, как любовь и заботу",
];

export const relationshipParentsChildhoodOprions = [
  "жили отдельно и не встречались",
  "жили отдельно, иногда встречались и конфликтовали",
  "жили вместе и при этом иногда дрались или громко ругались (имело место эмоциональное или физическое насилие)",
  "жили вместе и при этом не ругались, но не обнимались",
  "по-доброму поддерживали друг друга, обнимали друг друга (даже если не жили вместе)",
];

export const relationshipParentsNowOptions = [
  "Я зависим от их мнения, они активно участвуют в моей жизни (я согласую свои решения, они принимают участие в моих семейных делах, например решениях об отпуске, тратах, детях, я с ними советуюсь по большинству вопросов и нуждаюсь в их одобрении и т.д.)",
  "Они зависят от меня, я несу за них ответственность и их контролирую (окружаю повседневной заботой, включаюсь во все вопросы, влияю на принятие решений, помогаю разрешить конфликтные ситуации, оплачиваю коммуналку и т.д.)",
  "Я финансово завишу от родителей",
  "Родители финансово зависят от меня",
  "У меня напряженные отношения с родителями, мы часто ругаемся и повышаем друг на друга голос, это приводит к обидам и переживаниям",
  "Мы не общаемся",
  "У нас независимые семьи, мы созваниваемся, комфортно общаемся, мы уважительно относимся друг к другу и поддерживаем при необходимости",
];

export const communicationOptions = [
  "ежедневно",
  "несколько раз в неделю",
  "раз в неделю",
  "несколько раз в месяц",
  "раз в месяц",
  "реже",
];

export const whoDiedOptions = ["брат", "сестра", "мама", "папа"];

export const copingWithLossOptions = [
  "получали поддержку от семьи и друзей",
  "обращались за профессиональной помощью",
  "справлялись самостоятельно",
  "ваш вариант",
];
