export const educationOptions = [
  "Среднее",
  "Среднеспециальное",
  "Высшее образование, бакалавр.",
  "Высшее образование, магистратура",
  "2 и более высших",
  "Аспирантура",
  "Докторантура",
];

export const professionSatisfactionOptions = [
  "очень удовлетворен",
  "удовлетворен",
  "нейтрально",
  "неудовлетворен",
  "очень неудовлетворен",
];

export const frequencyOptions = [
  "ежедневно",
  "несколько раз в неделю",
  "раз в неделю",
  "несколько раз в месяц",
  "раз в месяц",
  "реже",
];

export const preferredRestOptions = [
  "Активный отдых (походы, спорт)",
  "Путешествия",
  "Культурный отдых (посещение театров, музеев)",
  "Семейные встречи и мероприятия",
  "Домашние занятия (чтение, рукоделие)",
  "Ночные клубы",
  "Игры/ квесты/ нетворкинги",
  "Дача / баня  / шашлыки",
  "Мастерить, ремесленничать, чинить машину и т.п.",
];

export const restFrequencyOptions = [
  "ежедневно",
  "несколько раз в неделю",
  "раз в неделю",
  "несколько раз в месяц",
  "раз в месяц",
  "реже",
  "ваш вариант",
];

export const booksAt10Options = [" 0-9", "10-50", "51-100", "100+"];

export const readingFrequencyAt10Options = [
  "ежедневно",
  "несколько раз в неделю",
  "раз в неделю",
  "несколько раз в месяц",
  "раз в месяц",
  "реже чем раз в месяц",
  "особо не читал, только школьную программу",
  "ваш вариант",
];

export const currentReadingFrequencyOptions = [
  "ежедневно",
  "несколько раз в неделю",
  "раз в неделю",
  "несколько раз в месяц",
  "раз в месяц",
  "реже чем раз в месяц",
  "место чтения слушаю аудиокниги",
  "ваш вариант",
];
