export const emotional = [
  "Злоба, раздражительность",
  "Резкие смены настроения",
  "Стресс, напряженность, тревожность",
  "Депрессия, потеря надежды, интереса ко всему",
  "Кошмары во сне",
  "Дефицит самоуважения",
];

export const cognitive = [
  "Проблемы внимания",
  "Проблемы с памятью",
  "Неуверенность в принятии решений",
  "Проблемы самоорганизации",
  "Навязчивые мысли",
  "Потеря чувства реальности",
];

export const social = [
  "Конфликт на работе/в учебе",
  "Трудности общения с людьми",
  "Конфликт в семье",
  "Страх будучи в многолюдных местах",
  "Социальная изоляция",
  "Потеря близкого",
];

export const physical = [
  "Головные боли",
  "Головокружение",
  "Усталость",
  "Проблемы сна",
  "Пере/недоедание",
  "Сексуальное или физическ. насилие",
];
