export const bloodTypeOptions = ["I", "II", "III", "IV", "не знаю"];

export const handOptions = ["П", "Л"];

export const birthConditionsOptions = [
  "естественным путем",
  "кесарево сечение",
  "не знаю",
];

export const ilnessOptions = [
  "Сердце",
  "Болезни кожи, экзема",
  "Щитовидная железа, йодный обмен",
  "Поджелудочная железа, диабет",
  "Желчный пузырь, вкл. камни",
  "Печень, вкл. гепатит",
  "Желудок, язвы",
  "Почки, вкл. камни, диурез",
  "Надпочечники",
  "Мочевой пузырь",
  "Гинекология-урология – инфекции",
  "Гинекология-урология – структуры",
  "Кишечник, вкл. раздраженный",
  "Инфекции уха или головы",
  "Общие инфекции тела, вкл. грипп, ковид",
  "Инфекции легких (брохит, воспаление)",
  "Проблемы с легкими (не инфекция)",
  "Пищевое отравление до рвоты",
  "Пищевая аллергия",
  "Аллергия на средовые агенты (пыль, пыльцу, животных, контактная)",
  "Высокое давление",
  "Низкое давление",
  "Эпилептический приступ",
  "Психотический эпизод",
  "Мигрени (головные боли без причины)",
  "Костный мозг",
  "Кости, соединительная ткань",
  "астма",
  "проблемы слуха или зрения",
  "потеря вкуса или запаха",
  "проблемы с равновесием",
  "психиатрические проблемы",
];

export const scoreOptions = [
  { value: 0, label: "Никогда" },
  { value: 1, label: "1 раз до 14 лет" },
  { value: 2, label: "2-3 раза до 14 лет" },
  { value: 3, label: "1 раз только с 14 до 22х" },
  { value: 4, label: "2-3 раза с 14 до 22х" },
  { value: 5, label: "Были проблемы в детстве и 1 раз после 22х" },
  { value: 6, label: "Было и в детстве и после 22х несколько раз" },
  { value: 7, label: "Повторяется примерно раз в год" },
  { value: 8, label: "Лечусь у врача, хороший прогноз" },
  { value: 9, label: "Тяжелый диагноз, интенсивно лечусь" },
  { value: 10, label: "Система практически отказала" },
];

export const feelingHelplessFrequencyOptions = [
  "почти никогда",
  "было несколько раз в жизни",
  "1-2 раза в год",
  "раз в месяц",
  "несколько раз в месяц",
  "есколько раз в неделю",
  "ежедневно",
  "ваш вариант",
];

export const dietRestrictionsOptions = [
  "по медицинским показаниям",
  "Вегетарианец",
  "Строгий веган",
  "Религиозные",
  "я правильно питаюсь по ЗОЖ",
];

export const alcoholConsumptionDynamicOptions = [
  "увеличилось",
  "уменьшилось",
  "стабильно",
  "свой вариант",
];

export const smokingDynamicOptions = [
  "увеличилось",
  "уменьшилось",
  "стабильно",
  "свой вариант",
];

export const otherDrugsDynamicOptions = [
  "увеличилось / добавилось",
  "уменьшилось",
  "стабильно",
  "отказался",
  "свой вариант",
];

export const alcoholConsumptionWeeklyOptions = [
  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
  22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
  41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
];

export const sleepLatencyOptions = [
  ...Array.from({ length: 60 }, (_, i) => i).map((minute) => `${minute} минут`),
  ...Array.from({ length: 12 }, (_, i) => i + 1).map(
    (hour) => `${hour} час${hour > 1 ? "а" : ""}`
  ),
];

export const mealSizeOptions = [1, 2, 3, 4, 5];