export const wallDecorOptions = [
  "Искусство (картины, художественные фотографии)",
  "Декоративные элементы (зеркала, часы, цветы)",
  "Семейные фотографии",
  "Ничего",
  "ваш вариант",
];

export const preferredFurnitureOptions = [
  "Классическую",
  "Современную",
  "Минималистичную",
  "Эклектичную (сочетание разных стилей)",
  "ваш вариант",
];

export const dominantColorsOptions = [
  "Яркие и насыщенные",
  "Спокойные и пастельные",
  "Нейтральные (белый, серый, черный)",
  "Микс",
  "ваш вариант",
];

export const regularActivitiesOptions = [
  "Спортзал (бассейн)",
  "Церковь/религиозные собрания",
  "Концерты/театры",
  "Футбольные матчи/спортивные события",
  "Выставки/музеи",
  "Квесты/ нетворкинги / игры",
  "активная ночная жизнь (клубы, тусовки)",
  "ваш вариант",
];

export const adviceSourceOptions = [
  "Интернет",
  "Семья / Друзья",
  "Эксперты/профессионалы",
  "Сам пробую и учусь на своих ошибках",
  "ваш вариант",
];

export const transportAudioOptions = [
  "Свой плейлист",
  "Тихо, без музыки",
  "Аудиокниги/подкасты",
  "Радио",
  "Разговариваю по телефону",
  "ваш вариант",
];

export const preferredChannelsOptions = [
  "Новости",
  "Развлекательные шоу",
  "Документальные фильмы",
  "Спортивные каналы",
  "Познавательные каналы (путешествия, природа, кулинария и т.д.)",
  "Художественные фильмы",
  "ваш вариант",
];

export const aloneTimeActivitiesOptions = [
  "Полежать на диване, принять ванну и т.п. релакс",
  "Чтение книг",
  "Просмотр фильмов/сериалов",
  "Занятия хобби",
  "Прогулки на свежем воздухе",
  "Социальные сети",
  "ваш вариант",
];

export const preferredSportsOptions = [
  "Индивидуальные виды спорта (бег, плавание)",
  "Командные виды спорта (футбол, баскетбол)",
  "Йога/пилатес",
  "ваш вариант",
];

export const socialMediaFrequencyOptions = [
  "Каждый день",
  "Несколько раз в неделю",
  "Раз в неделю",
  "Очень редко",
  "ваш вариант",
];

export const socialMediaDetoxOptions = [
  "Это помогает мне быть постоянно на связи и в курсе событий и мне это не мешает",
  "Это есть мой способ отдыха и переключения",
  "Очень редко",
  "Примерно раз в неделю устраиваю перерыв",
  "Нужно устраивать детокс несколько раз в неделю",
  "Да, понимаю свою зависимость и нужно уменьшать ежедневное время, проводимое за гаджетами, но это очень сложно для меня",
  "ваш вариант",
];
